
var arrLang = {
  'ua': {
    1: 'Рейтинг кредитiв пiд 0.01%',
            2: 'Вік <br> 18-80',
            3: 'Термін <br> до 30 днів',
            4: 'Отримати гроші',
            5: 'Вік <br> 18-89',
            6: 'Вік <br> 18-65',
            7: 'Вік <br> 18-70',
            8: 'Термін <br> до 70 днів',
            9: 'Заповніть заявку зараз, і гроші у вас',
            10: 'Послугу з пошуку кредитних пропозицій надає інформаційний сайт «ВсіЗайми». Сайт не надає платні послуги з кредитних продуктів для клієнтів, а саме пропонує клієнту список пропозицій кредитних установ, некредитних фінансових організацій, до яких клієнт може звернутися з метою оформлення заявки на кредитний продукт. Проект не є банком або кредитором, не належить до фінансових установ і не несе відповідальності за наслідки будь-яких укладених договорів кредитування або поручительство перед ним. Мінімальна процентна ставка у деяких партнерів становить 0.01%. Щоб оформити заявку на отримання позики, необхідно заповнити анкету на сайті проекту. Здійснюючи будь-які дії на сайті, ви повинні надати свою Згоду на обробку персональних даних і Згоду на отримання рекламних матеріалів. Ви ознайомились та погоджуєтесь з Договором публічної оферти та Тарифами сервісу. Сервіс «ВсіЗайми» використовує кукі для надання послуг. Умови зберігання або доступу до кукі Ви можете налаштувати в своєму браузері. Сервіс призначений для осіб від 18 років. Розрахунок у калькуляторах, що наданий на сайті, базується на середньому показнику відсоткової ставки, яка буде запропонована вам фінансовими організаціями.'
  },
  'ru': {
     1: 'Рейтинг кредитов под 0,01%',
            2: 'Возраст <br> 18-80',
            3: 'Срок <br> до 30 дней',
            4: 'Получить деньги',
            5: 'Возраст <br> 18-89',
            6: 'Возраст <br> 18-65',
            7: 'Возраст <br> 18-70',
            8: 'Срок <br> до 70 дней',
            9: 'Заполните заявку сейчас, и деньги у вас',
            10: 'Услуги по поиску кредитных предложений предоставляет информационный сайт "ВсеЗаймы". Сайт не предоставляет платные услуги по кредитным продуктам для клиентов, а предлагает клиенту список предложений кредитных учреждений, некредитных финансовых организаций, к которым клиент может обратиться с целью оформления заявки на кредитный продукт. Проект не является банком или кредитором, не пренадлежит к финансовым учреждениям и не несёт ответственность за последствия любых заключённых договоров кредитования либо поручительства перед ним. Минимальная процентная ставка у некоторых партнёров составляет 0,01%. Чтобы оформить заявку на получение заёма, необходимо заполнить анкету на сайте проекта. Выполняя любые действия на сайте, ви должны дать своё согласие на обработку персональных данных и согласие на получение рекламных материалов. Вы ознакомились и соглашаетесь с Договором публичной оферты и тарифами сервиса. Сервис "ВсеЗаймы" исспользует куки для предоставления услуг. Условия хранения или доступа к куки Вы можете настроить в соём браузере. Сервис предназначен для лиц от 18 лет. Расчёт в калькуляторах, которые предоставлены на сайте, базируется на среднем показателе процентной ставки, которая будет предложена вам финансовыми организациями.'
  }
}


 $(function() {
    $('.translate').click(function() {
      var lang = $(this).attr('id');

      $('.lang').each(function(index, item) {
        $(this).html(arrLang[lang][$(this).attr('key')]);
      });
    });
});

 $(document).on('click', '.language-img', function(){
    $(this).addClass('active').siblings().removeClass('active')
 });


(function () {
    "use strict";
    $(document).ready(function () {
        var LinkTest = {};
        // External Links
        LinkTest.externalLinks = function () {
            $('a[href^=http]').click(function () {
                window.open(this.href);
                return false;
            });
        }();

    });
});
 